{
  "level": "ukrainian",
  "name_ua": "Українська",
  "name_ru": "Украинский",
  "name_en": "Ukrainian",
  "description_ua": "Уроки українською мовою",
  "description_ru": "Уроки на украинском языке",
  "description_en": "Ukrainian language lessons",
  "lessons": [
    {
      "id": 1,
      "name": "Домашній ряд - ФІВА ОЛДЖ",
      "description": "Базові позиції пальців",
      "layout": "ua",
      "text": "фіва олдж фіва олдж фіва олдж фіва олдж фіва олдж фіва олдж фіва олдж фіва олдж",
      "difficulty": "easy"
    },
    {
      "id": 2,
      "name": "Прості слова",
      "description": "Набираємо перші слова",
      "layout": "ua",
      "text": "дім кіт мама тато вода рука нога день ніч стіл стілець вікно двері лампа книга",
      "difficulty": "easy"
    },
    {
      "id": 3,
      "name": "Добрі слова",
      "description": "Позитивні емоції",
      "layout": "ua",
      "text": "Посмішка дарує радість. Доброта робить світ кращим. Дружба зігріває серце. Любов перемагає все. Надія веде вперед. Мрії збуваються.",
      "difficulty": "easy"
    },
    {
      "id": 4,
      "name": "Карпатські гори",
      "description": "Природа України",
      "layout": "ua",
      "text": "Карпати вкриті густими лісами та альпійськими луками. Тут живуть рідкісні тварини: бурі ведмеді, рисі та благородні олені. Гірські потоки несуть кришталево чисту воду. Полонини вкриті барвистими квітами влітку. Взимку гори перетворюються на казкову країну снігу.",
      "difficulty": "medium"
    },
    {
      "id": 5,
      "name": "Дніпро - водна артерія",
      "description": "Річка що об'єднує",
      "layout": "ua",
      "text": "Дніпро третя за довжиною річка Європи після Волги та Дунаю. Вона протікає через центр України, з'єднуючи північ і південь країни. На берегах Дніпра розташовані найбільші міста: Київ, Дніпро, Запоріжжя, Херсон. Річка живила українські землі століттями, даруючи воду для землеробства та рибу для харчування. Дніпровські пороги були легендарним місцем, про яке складали думи та пісні. Козаки будували свої січі поруч з порогами, використовуючи природний захист.",
      "difficulty": "medium"
    },
    {
      "id": 6,
      "name": "Українська вишиванка",
      "description": "Традиції в орнаментах",
      "layout": "ua",
      "text": "Вишиванка це не просто одяг а справжня енциклопедія українського народу. Кожен орнамент має своє значення та розповідає історію. Геометричні візерунки символізують родючість землі та врожай. Рослинні мотиви втілюють зв'язок з природою. Червоний колір означає любов до життя, чорний символізує землю та мудрість предків. У різних регіонах України розвинулися свої унікальні стилі вишивки. Полтавська вишивка вражає витонченістю білого по білому. Гуцульська сяє яскравими барвами та складними узорами. Кожна вишиванка несе енергію майстрині що її створила.",
      "difficulty": "medium"
    },
    {
      "id": 7,
      "name": "Київська Русь",
      "description": "Витоки державності",
      "layout": "ua",
      "text": "Київська Русь була могутньою середньовічною державою що існувала з дев'ятого по тринадцяте століття. Столиця Київ був одним з найбільших та найбагатших міст Європи того часу. Тут налічувалося понад чотириста церков та вісім ринків. Володимир Великий хрестив Русь у дев'ятсот вісімдесят вісьмому році, що відкрило шлях до європейської цивілізації. Ярослав Мудрий створив перший писемний звід законів Руську Правду. При ньому Київ розквітнув як центр освіти та культури. Софійський собор став символом золотого віку Русі. Київські майстри створювали неперевершені мозаїки та фрески. Літописці записували історію для нащадків. Русь торгувала з Візантією, скандинавськими країнами та Сходом, збагачуючись культурно та економічно.",
      "difficulty": "hard"
    },
    {
      "id": 8,
      "name": "Козацька слава",
      "description": "Захисники свободи",
      "layout": "ua",
      "text": "Запорізька Січ була унікальним явищем в історії Європи демократичною військовою республікою. Козаки обирали свого гетьмана на загальній раді де кожен мав право голосу. Вони захищали українські землі від набігів татар та турків, ризикуючи життям заради свободи народу. Козацька доблесть стала легендою. Богдан Хмельницький підняв повстання проти польського гніту та створив козацьку державу. Іван Мазепа прагнув незалежності України, вступивши в союз зі шведським королем. Петро Сагайдачний здійснював сміливі походи на Чорне море. Козаки володіли унікальною тактикою бою використовуючи легкі човни чайки для морських набігів. Січ була школою мужності де юнаки ставали воїнами. Тут панував кодекс честі та братерства. Козаки цінували свободу понад усе, кажучи що воля дорожча за золото.",
      "difficulty": "hard"
    },
    {
      "id": 9,
      "name": "Чорнобильська катастрофа",
      "description": "Урок для людства",
      "layout": "ua",
      "text": "Двадцять шостого квітня тисяча дев'ятсот вісімдесят шостого року сталася найбільша техногенна катастрофа в історії. Вибух на четвертому енергоблоці Чорнобильської АЕС викинув у атмосферу величезну кількість радіоактивних речовин. Пожежники та ліквідатори героїчно боролися з вогнем, не знаючи про смертельну небезпеку радіації. Багато з них загинули від променевої хвороби ставши справжніми героями. Тридцять кілометрову зону довкола станції евакуювали, люди залишили свої домівки назавжди. Прип'ять перетворилася на місто-примару де зупинився час. Природа повільно повертається до покинутих місць створюючи дивний симбіоз руїн та дикої природи. Чорнобиль нагадує нам про відповідальність перед майбутніми поколіннями та про те що деякі помилки неможливо виправити.",
      "difficulty": "hard"
    },
    {
      "id": 10,
      "name": "Українська кухня",
      "description": "Смаки що з'єднують покоління",
      "layout": "ua",
      "text": "Український борщ це не просто страва а символ домашнього затишку та родинного тепла. Кожна господиня має свій секретний рецепт що передається з покоління в покоління. Вареники з вишнями, картоплею або сиром вміють готувати в кожній українській родині. Сало українці вважають делікатесом який цінується не менше за найвитонченіші закуски. Деруни хрумкі картопляні оладки часто подають зі сметаною. Голубці капустяні рулети з м'ясом та рисом готують на свята. Узвар компот з сухофруктів обов'язково ставлять на різдвяний стіл.",
      "difficulty": "medium"
    },
    {
      "id": 11,
      "name": "Тарас Шевченко",
      "description": "Великий Кобзар України",
      "layout": "ua",
      "text": "Тарас Григорович Шевченко народився в родині кріпаків тисяча вісімсот чотирнадцятого року. Дитинство в неволі загартувало його дух та наповнило серце жагою до свободи. Талант до малювання врятував його коли друзі викупили Тараса з кріпацтва. Він здобув освіту в Академії мистецтв у Санкт-Петербурзі де розквітнув його художній талант. Але справжню славу принесла йому поезія. Збірка Кобзар стала маніфестом українського національного відродження. Шевченко писав про страждання народу під гнітом, про красу рідної землі, про мрію про волю. За свої вільнолюбні вірші його заслали на десять років до солдатів з забороною писати та малювати. Але навіть у засланні він продовжував творити ховаючи твори від наглядачів. Шевченко помер у тисяча вісімсот шістдесят першому році незадовго до скасування кріпацтва про яке так мріяв.",
      "difficulty": "hard"
    },
    {
      "id": 12,
      "name": "Софія Київська",
      "description": "Перлина архітектури",
      "layout": "ua",
      "text": "Софійський собор в Києві побудований в одинадцятому столітті за часів Ярослава Мудрого став символом могутності Київської Русі. Собор названий на честь храму Святої Софії в Константинополі підкреслюючи зв'язок з Візантією. Тринадцять куполів собору символізують Христа та дванадцять апостолів. Всередині зберігся унікальний комплекс мозаїк та фресок одинадцятого століття площею понад двісті шістдесят квадратних метрів. Золота мозаїка Оранти Богоматері Нерушимої Стіни вражає своєю величчю та збереженістю кольорів. Фрески зображують не лише релігійні сюжети але й сцени з придворного життя полювання та забави. На стінах збереглися давні графіті написи відвідувачів одинадцятого тринадцятого століть що дають унікальну інформацію про мову та побут того часу.",
      "difficulty": "hard"
    },
    {
      "id": 13,
      "name": "Українські писанки",
      "description": "Мистецтво на яйці",
      "layout": "ua",
      "text": "Писанка це унікальне українське мистецтво розпису яєць воском та барвниками що налічує тисячі років історії. Кожен символ на писанці має глибоке значення закладене предками. Сонце означає життя та енергію, зірки символізують долю, хрест захист від зла. Безкінечник вічність життя, дерево зв'язок поколінь. Писанки розписували лише жінки дотримуючись особливих ритуалів. Роботу починали в чистоті та з молитвою вкладаючи в кожен візерунок добрі побажання. Колір також мав значення червоний любов та радість, жовтий достаток, зелений весна та відродження, чорний земля та мудрість.",
      "difficulty": "medium"
    },
    {
      "id": 14,
      "name": "Хортиця острів свободи",
      "description": "Колиска козацтва",
      "layout": "ua",
      "text": "Острів Хортиця на Дніпрі найбільший річковий острів Європи став колискою запорізького козацтва. Тут розташовувалися перші козацькі січі фортеці свободи серед дніпровських порогів. Природні умови острова ідеально підходили для оборони пороги захищали з півдня а густі ліси та болота ховали козацькі табори. На Хортиці збиралися вільні люди які тікали від кріпацтва та шукали волі. Тут не було панів усі були рівні перед законом січі. Острів став центром козацької культури де формувалися традиції та звичаї вільного народу.",
      "difficulty": "medium"
    },
    {
      "id": 15,
      "name": "Бандура душа України",
      "description": "Інструмент що співає",
      "layout": "ua",
      "text": "Бандура унікальний український струнний інструмент що поєднує риси лютні та гуслів налічує від тридцяти до шістдесяти струн. Кобзарі мандрівні співці грали на бандурі та передавали історичні думи про козацьку славу героїчні битви та народні страждання. Вони були живою пам'яттю народу зберігаючи в піснях те що не змогли записати літописи. Радянська влада боялася кобзарів як носіїв національної свідомості та піддавала їх репресіям. Багато майстрів загинули але традиція вижила. Сьогодні бандура переживає відродження молоді музиканти відкривають для себе цей інструмент.",
      "difficulty": "hard"
    },
    {
      "id": 16,
      "name": "Голодомор народна трагедія",
      "description": "Пам'ять що не згасне",
      "layout": "ua",
      "text": "Голодомор тисяча дев'ятсот тридцять другого тридцять третього років штучно організований радянською владою голод забрав життя мільйонів українців. Село позбавили зерна худоби насіння навіть городини. Люди помирали посеред родючих чорноземів на яких могла б годуватися вся Європа. Селянам забороняли виїжджати з голодуючих сіл щоб приховати масштаби трагедії від світу. НКВС конфісковувало останні крихти їжі засуджуючи цілі родини на смерть. Матері не могли нагодувати дітей старі помирали від виснаження. Вимерли цілі села зникли з лиця землі. Ця трагедія була геноцидом спрямованим на знищення українського селянства як основи нації.",
      "difficulty": "hard"
    },
    {
      "id": 17,
      "name": "Львів місто лева",
      "description": "Культурна столиця",
      "layout": "ua",
      "text": "Львів заснований в тисяча двісті п'ятдесят шостому році князем Данилом Галицьким та названий на честь його сина Лева став перехрестям культур де зустрічалися Схід і Захід. Старе місто Львова внесене до списку Всесвітньої спадщини ЮНЕСКО зберігає атмосферу середньовічної Європи. Бруковані вулиці ведуть до площі Ринок серця міста оточеного кам'яницями різних епох. Кожна будівля тут має свою історію та легенду. Львів славиться своїми кав'ярнями де народжувалися літературні та мистецькі рухи. Тут жили та творили видатні письменники художники композитори.",
      "difficulty": "medium"
    },
    {
      "id": 18,
      "name": "Мова що оживає",
      "description": "Відродження української",
      "layout": "ua",
      "text": "Українська мова витримала століття утисків заборон та русифікації але не зламалася. Емський указ тисяча вісімсот сімдесят шостого року заборонив друкувати книги українською мовою окрім художньої літератури. Радянська влада спочатку підтримувала українізацію а потім жорстоко придушила її репресуючи інтелігенцію. Українську витісняли зі шкіл університетів офіційного вжитку. Але мова жила в селах у піснях у серцях патріотів. З здобуттям незалежності почалося відродження української в усіх сферах життя. Сьогодні українська звучить у парламенті на телебаченні в інтернеті стає мовою успіху та модерності.",
      "difficulty": "hard"
    },
    {
      "id": 19,
      "name": "Майдан воля народу",
      "description": "Революція гідності",
      "layout": "ua",
      "text": "Листопад дві тисячі тринадцятого року Київ вийшов на Майдан Незалежності протестуючи проти відмови влади підписати угоду про асоціацію з Європейським Союзом. Студенти та молодь першими стали в центрі міста вимагаючи європейського шляху для України. Жорстокий розгін мирного протесту силовиками розпалив полум'я революції. Сотні тисяч людей прийшли підтримати Майдан принісши з собою намети їжу дрова. Зимою люди стояли на морозі співали гімн та вірили в перемогу справедливості. Снайпери стріляли в беззбройних активістів але Майдан не здався. Небесна сотня герої які віддали життя за свободу стали символом незламності українського духу.",
      "difficulty": "hard"
    },
    {
      "id": 20,
      "name": "Україна сьогодні",
      "description": "Шлях до майбутнього",
      "layout": "ua",
      "text": "Україна молода незалежна держава що здобула свободу в тисяча дев'ятсот дев'яносто першому році після розпаду Радянського Союзу. Шлях до справжньої незалежності виявився складним і болісним. Дві революції Помаранчева та Революція Гідності показали прагнення народу до демократії та європейських цінностей. Російська агресія анексія Криму та війна на Донбасі стали випробуванням на міцність молодої нації. Українці довели свою готовність захищати свободу та незалежність ціною власного життя. Країна реформується змінює економіку боре

ться з корупцією будує громадянське суспільство. Молоде покоління вільних українців створює нову країну європейську демократичну успішну.",
      "difficulty": "hard"
    }
  ]
}

